Revit 2024 API
AnalyticalElement.GetTransform Method
 Returns the transform which reflects Analytical Element orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public Transform GetTransform()
Visual Basic
Public Function GetTransform As Transform
Visual C++
public:
Transform^ GetTransform()
Return Value
 The orientation of the Analytical Element.
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace